{
    "name": "Chongyun",
    "rarity": "4 Stars",
    "element": "Cryo",
    "weaponType": "Claymore",
    "region": "Liyue",
    "talents": [
        {
            "name": "Demonbane",
            "type": "Normal Attack",
            "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\n\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\nAt the end of the sequence, performs a more powerful slash.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n"
        },
        {
            "name": "Spirit Blade: Chonghua's Layered Frost",
            "type": "Elemental Skill",
            "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG.\nAfter a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all Sword, Claymore and Polearm-wielding characters' weapons will be infused with Cryo.\n"
        },
        {
            "name": "Spirit Blade: Cloud-Parting Star",
            "type": "Elemental Burst",
            "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground.\nWhen the spirit blades explode, they will deal AoE Cryo DMG and launch opponents.\n"
        },
        {
            "name": "Steady Breathing",
            "type": "1st Ascension Passive",
            "description": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade: Chonghua's Layered Frost have their Normal ATK SPD increased by 8%."
        },
        {
            "name": "Rimechaser Blade",
            "type": "4th Ascension Passive",
            "description": "When the field created by Spirit Blade: Chonghua's Layered Frost disappears, another spirit blade will be summoned to strike nearby opponents, dealing 100% of Chonghua's Layered Frost's Skill DMG as AoE Cryo DMG.\nOpponents hit by this blade will have their Cryo RES decreased by 10% for 8s.\n"
        },
        {
            "name": "Gallant Journey",
            "type": "Utility Passive",
            "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.\n"
        }
    ],
    "constellations": [
        {
            "name": "Ice Unleashed",
            "level": 1,
            "description": "The last attack of Chongyun's Normal Attack combo releases 3 ice blades. Each blade deals 50% of Chongyun's ATK as Cryo DMG to all opponents in its path.\n"
        },
        {
            "name": "Atmospheric Revolution",
            "level": 2,
            "description": "Elemental Skills and Elemental Bursts cast within the Frost Field created by Spirit Blade: Chonghua's Layered Frost have their CD time decreased by 15%.\n"
        },
        {
            "name": "Cloudburst",
            "level": 3,
            "description": "Increases the Level of Spirit Blade: Cloud-Parting Star by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Frozen Skies",
            "level": 4,
            "description": "Chongyun regenerates 1 Energy every time he hits an opponent affected by Cryo.\nThis effect can only occur once every 2s."
        },
        {
            "name": "The True Path",
            "level": 5,
            "description": "Increases the Level of Spirit Blade: Chonghua's Layered Frost by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Rally of Four Blades",
            "level": 6,
            "description": "Spirit Blade: Cloud-Parting Star deals 15% more DMG to opponents with a lower percentage of their Max HP remaining than Chongyun.\nThis skill will also summon 1 additional spirit blade.\n"
        }
    ]
}