{
    "name": "Rosaria",
    "rarity": "4 Stars",
    "element": "Cryo",
    "weaponType": "Polearm",
    "region": "Mondstadt",
    "talents": [
        {
            "name": "Spear of the Church",
            "type": "Normal Attack",
            "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes.\n\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n"
        },
        {
            "name": "Ravaging Confession",
            "type": "Elemental Skill",
            "description": "Rosaria swiftly shifts her position to appear behind her opponent, then stabs and slashes them with her polearm, dealing Cryo DMG.\nThis ability cannot be used to travel behind opponents of a larger build.\n"
        },
        {
            "name": "Rites of Termination",
            "type": "Elemental Burst",
            "description": "Rosaria's unique take on this prayer ritual: First, she swings her weapon to slash surrounding opponents; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG.\nWhile active, the Ice Lance periodically releases a blast of cold air, dealing Cryo DMG to surrounding opponents.\n"
        },
        {
            "name": "Regina Probationum",
            "type": "1st Ascension Passive",
            "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s."
        },
        {
            "name": "Shadow Samaritan",
            "type": "4th Ascension Passive",
            "description": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\nCRIT Rate Bonus gained this way cannot exceed 15%.\n"
        },
        {
            "name": "Night Walk",
            "type": "Utility Passive",
            "description": "At night (18:00 – 6:00), your party members gain the Swift Stride effect: Movement SPD increased by 10%.\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Swift Stride does not stack.\n"
        }
    ],
    "constellations": [
        {
            "name": "Unholy Revelation",
            "level": 1,
            "description": "When Rosaria deals a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s."
        },
        {
            "name": "Land Without Promise",
            "level": 2,
            "description": "The duration of the Ice Lance created by Rites of Termination is increased by 4s."
        },
        {
            "name": "The Wages of Sin",
            "level": 3,
            "description": "Increases the Level of Ravaging Confession by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Painful Grace",
            "level": 4,
            "description": "Ravaging Confession's CRIT Hits regenerate 5 Energy for Rosaria.\nCan only be triggered once each time Ravaging Confession is cast."
        },
        {
            "name": "Last Rites",
            "level": 5,
            "description": "Increases the Level of Rites of Termination by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Divine Retribution",
            "level": 6,
            "description": "Rites of Termination's attack decreases opponents' Physical RES by 20% for 10s."
        }
    ]
}