{
    "name": "Barbara",
    "rarity": "4 Stars",
    "element": "Hydro",
    "weaponType": "Catalyst",
    "region": "Mondstadt",
    "talents": [
        {
            "name": "Whisper of Water",
            "type": "Normal Attack",
            "description": "Normal Attack\nPerforms up to 4 water splash attacks that deal Hydro DMG.\n\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time.\n\nPlunging Attack\nGathering the might of Hydro, Barbara plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Hydro DMG upon impact with the ground.\n"
        },
        {
            "name": "Let the Show Begin♪",
            "type": "Elemental Skill",
            "description": "Summons water droplets resembling musical notes that form a Melody Loop, dealing Hydro DMG to surrounding opponents and applying the Wet status to them.\n\nMelody Loop\nOn hit, Barbara's Normal Attacks heal your own party members and nearby teammates for a certain amount of HP, which scales with Barbara's Max HP.\nOn hit, Barbara's Charged Attack generates 4 times the amount of healing.\nPeriodically regenerates your own active character's HP.\nApplies the Wet status to the character and to opponents who come in contact with them.\n"
        },
        {
            "name": "Shining Miracle♪",
            "type": "Elemental Burst",
            "description": "Heals your own party members and nearby teammates for a large amount of HP that scales with Barbara's Max HP.\n"
        },
        {
            "name": "Glorious Season",
            "type": "1st Ascension Passive",
            "description": "The Stamina Consumption of characters within Let the Show Begin♪'s Melody Loop is reduced by 12%."
        },
        {
            "name": "Encore",
            "type": "4th Ascension Passive",
            "description": "When your active character gains an Elemental Orb/Particle, the duration of the Melody Loop of Let the Show Begin♪ is extended by 1s.\nThe maximum extension is 5s."
        },
        {
            "name": "With My Whole Heart♪",
            "type": "Utility Passive",
            "description": "When a Perfect Cooking is achieved on a dish with restorative effects, Barbara has a 12% chance to obtain double the product.\n"
        }
    ],
    "constellations": [
        {
            "name": "Gleeful Songs",
            "level": 1,
            "description": "Barbara regenerates 1 Energy every 10s."
        },
        {
            "name": "Vitality Burst",
            "level": 2,
            "description": "Decreases the CD of Let the Show Begin♪ by 15%.\nDuring the ability's duration, your active character gains a 15% Hydro DMG Bonus.\n"
        },
        {
            "name": "Star of Tomorrow",
            "level": 3,
            "description": "Increases the Level of Shining Miracle♪ by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Attentiveness Be My Power",
            "level": 4,
            "description": "Every opponent Barbara hits with her Charged Attack regenerates 1 Energy for her.\nA maximum of 5 energy can be regenerated in this manner with any one Charged Attack."
        },
        {
            "name": "The Purest Companionship",
            "level": 5,
            "description": "Increases the Level of Let the Show Begin♪ by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Dedicating Everything to You",
            "level": 6,
            "description": "When Barbara is in the party but not on the field, and one of your own party members falls:\nAutomatically revives the fallen character.\nFully restores the revived character's HP to 100%.\nThis effect can only occur once every 15 mins.\n"
        }
    ]
}