{
    "name": "Xingqiu",
    "rarity": "4 Stars",
    "element": "Hydro",
    "weaponType": "Sword",
    "region": "Liyue",
    "talents": [
        {
            "name": "Guhua Style",
            "type": "Normal Attack",
            "description": "Normal Attack\nPerforms up to 5 rapid strikes.\n\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n"
        },
        {
            "name": "Guhua Sword: Fatal Rainscreen",
            "type": "Elemental Skill",
            "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit your active character.\nThe Rain Swords have the following properties:\nWhen a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.\nIncreases the character's resistance to interruption.\n\n20% of Xingqiu's Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords.\n\nThe maximum amount of additional DMG Reduction that can be gained this way is 24%.\nThe initial maximum number of Rain Swords is 3.\nUsing this ability applies the Wet status onto the character.\n"
        },
        {
            "name": "Guhua Sword: Raincutter",
            "type": "Elemental Burst",
            "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.\n\nRainbow Bladework\nYour active character's Normal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG.\nRain Swords will remain at the maximum number throughout the ability's duration.\n"
        },
        {
            "name": "Hydropathic",
            "type": "1st Ascension Passive",
            "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP."
        },
        {
            "name": "Blades Amidst Raindrops",
            "type": "4th Ascension Passive",
            "description": "Xingqiu gains a 20% Hydro DMG Bonus."
        },
        {
            "name": "Flash of Genius",
            "type": "Utility Passive",
            "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.\n"
        }
    ],
    "constellations": [
        {
            "name": "The Scent Remained",
            "level": 1,
            "description": "Increases the maximum number of Rain Swords by 1.\n"
        },
        {
            "name": "Rainbow Upon the Azure Sky",
            "level": 2,
            "description": "Extends the duration of Guhua Sword: Raincutter by 3s.\nDecreases the Hydro RES of opponents hit by sword rain attacks by 15% for 4s."
        },
        {
            "name": "Weaver of Verses",
            "level": 3,
            "description": "Increases the Level of Guhua Sword: Raincutter by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Evilsoother",
            "level": 4,
            "description": "Throughout the duration of Guhua Sword: Raincutter, the DMG dealt by Guhua Sword: Fatal Rainscreen is increased by 50%.\n"
        },
        {
            "name": "Embrace of Rain",
            "level": 5,
            "description": "Increases the Level of Guhua Sword: Fatal Rainscreen by 3.\nMaximum upgrade level is 15."
        },
        {
            "name": "Hence, Call Them My Own Verses",
            "level": 6,
            "description": "Activating 2 of Guhua Sword: Raincutter's sword rain attacks greatly enhances the third sword rain attack. On hit, the third sword rain attack also regenerates 3 Energy for Xingqiu.\n"
        }
    ]
}