[
    {
        "name": "Absolution",
        "rarity": 5,
        "attack": 674,
        "subStat": "CRIT DMG 44.1%",
        "effect": "Deathly Pact\nCRIT DMG increased by 20~40%. Increasing the value of a Bond of Life increases the DMG the equipping character deals by 16~32% for 6s. Max 3 stacks."
    },
    {
        "name": "Aquila Favonia",
        "rarity": 5,
        "attack": 674,
        "subStat": "Physical DMG Bonus 41.3%",
        "effect": "Falcon's Defiance\nATK is increased by 20~40%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of the resistance aloft, regenerating HP equal to 100~160% of ATK and dealing 200~320% of ATK as DMG to surrounding opponents. This effect can only occur once every 15s."
    },
    {
        "name": "Freedom-Sworn",
        "rarity": 5,
        "attack": 608,
        "subStat": "Elemental Mastery 198",
        "effect": "Revolutionary Chorale\nA part of the \"Millennial Movement\" that wanders amidst the winds.\nIncreases DMG by 10~20%.\nWhen the character wielding this weapon triggers Elemental Reactions, they gain a Sigil of Rebellion. This effect can be triggered once every 0.5s and can be triggered even if said character is not on the field.\nWhen you possess 2 Sigils of Rebellion, all of them will be consumed and all nearby party members will obtain \"Millennial Movement: Song of Resistance\" for 12s.\n\"Millennial Movement: Song of Resistance\" increases Normal, Charged, and Plunging Attack DMG by 16~32% and increases ATK by 20~40%. Once this effect is triggered, you will not gain Sigils of Rebellion for 20s.\nOf the many effects of the \"Millennial Movement,\" buffs of the same type will not stack."
    },
    {
        "name": "Haran Geppaku Futsu",
        "rarity": 5,
        "attack": 608,
        "subStat": "CRIT Rate 33.1%",
        "effect": "Honed Flow\nObtain 12~24% All Elemental DMG Bonus. When other nearby party members use Elemental Skills, the character equipping this weapon will gain 1 Wavespike stack. Max 2 stacks. This effect can be triggered once every 0.3s. When the character equipping this weapon uses an Elemental Skill, all stacks of Wavespike will be consumed to gain Rippling Upheaval: each stack of Wavespike consumed will increase Normal Attack DMG by 20~40% for 8s."
    },
    {
        "name": "Key of Khaj-Nisut",
        "rarity": 5,
        "attack": 542,
        "subStat": "HP 66.2%",
        "effect": "Sunken Song of the Sands\nHP increased by 20~40%. When an Elemental Skill hits opponents, you gain the Grand Hymn effect for 20s. This effect increases the equipping character's Elemental Mastery by 0.12~0.24% of their Max HP. This effect can trigger once every 0.3s. Max 3 stacks. When this effect gains 3 stacks, or when the third stack's duration is refreshed, the Elemental Mastery of all nearby party members will be increased by 0.2~0.4% of the equipping character's max HP for 20s."
    },
    {
        "name": "Light of Foliar Incision",
        "rarity": 5,
        "attack": 542,
        "subStat": "CRIT DMG 88.2%",
        "effect": "Whitemoon Bristle\nCRIT Rate is increased by 4~8%. After Normal Attacks deal Elemental DMG, the Foliar Incision effect will be obtained, increasing DMG dealt by Normal Attacks and Elemental Skills by 120~240% of Elemental Mastery. This effect will disappear after 28 DMG instances or 12s. You can obtain Foliar Incision once every 12s."
    },
    {
        "name": "Mistsplitter Reforged",
        "rarity": 5,
        "attack": 674,
        "subStat": "CRIT DMG 44.1%",
        "effect": "Mistsplitter's Edge\nGain a 12~24% Elemental DMG Bonus for all elements and receive the might of the Mistsplitter's Emblem. At stack levels 1/2/3, Mistsplitter's Emblem provides a 8/16/28~16/32/56% Elemental DMG Bonus for the character's Elemental Type. The character will obtain 1 stack of Mistsplitter's Emblem in each of the following scenarios: Normal Attack deals Elemental DMG (stack lasts 5s), casting Elemental Burst (stack lasts 10s); Energy is less than 100% (stack disappears when Energy is full). Each stack's duration is calculated independently."
    },
    {
        "name": "Peak Patrol Song",
        "rarity": 5,
        "attack": 542,
        "subStat": "DEF 82.7%",
        "effect": "Halcyon Years Unending\nGain \"Ode to Flowers\" after Normal or Plunging Attacks hit an opponent: DEF increases by 8~16% and gain a 10~20% All Elemental DMG Bonus for 6s. Max 2 stacks. Can trigger once per 0.1s. When this effect reaches 2 stacks or the 2nd stack's duration is refreshed, increase all nearby party members' All Elemental DMG Bonus by 8~16% for every 1,000 DEF the equipping character has, up to a maximum of 25.6~51.2%, for 15s."
    },
    {
        "name": "Primordial Jade Cutter",
        "rarity": 5,
        "attack": 542,
        "subStat": "CRIT Rate 44.1%",
        "effect": "Protector's Virtue\nHP increased by 20~40%. Additionally, provides an ATK Bonus based on 1.2~2.4% of the wielder's Max HP."
    },
    {
        "name": "Skyward Blade",
        "rarity": 5,
        "attack": 608,
        "subStat": "Energy Recharge 55.1%",
        "effect": "Sky-Piercing Fang\nCRIT Rate increased by 4~8%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and Normal and Charged hits deal additional DMG equal to 20~40% of ATK. Skypiercing Might lasts for 12s."
    },
    {
        "name": "Splendor of Tranquil Waters",
        "rarity": 5,
        "attack": 542,
        "subStat": "CRIT DMG 88.2%",
        "effect": "Dawn and Dusk by the Lake\nWhen the equipping character's current HP increases or decreases, Elemental Skill DMG dealt will be increased by 8~16% for 6s. Max 3 stacks. This effect can be triggered once every 0.2s. When other party members' current HP increases or decreases, the equipping character's Max HP will be increased by 14~28% for 6s. Max 2 stacks. This effect can be triggered once every 0.2s. The aforementioned effects can be triggered even if the wielder is off-field."
    },
    {
        "name": "Summit Shaper",
        "rarity": 5,
        "attack": 608,
        "subStat": "ATK 49.6%",
        "effect": "Golden Majesty\nIncreases Shield Strength by 20~40%. Scoring hits on opponents increases ATK by 4~8% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
        "name": "Uraku Misugiri",
        "rarity": 5,
        "attack": 542,
        "subStat": "CRIT DMG 88.2%",
        "effect": "Brocade Bloom, Shrine Sword\nNormal Attack DMG is increased by 16~32% and Elemental Skill DMG is increased by 24~48%. After a nearby active character deals Geo DMG, the aforementioned effects increase by 100% for 15s. Additionally, the wielder's DEF is increased by 20~40%."
    },
    {
        "name": "Amenoma Kageuchi",
        "rarity": 4,
        "attack": 454,
        "subStat": "ATK 55.1%",
        "effect": "Iwakura Succession\nAfter casting an Elemental Skill, gain 1 Succession Seed. This effect can be triggered once every 5s. The Succession Seed lasts for 30s. Up to 3 Succession Seeds may exist simultaneously. After using an Elemental Burst, all Succession Seeds are consumed and after 2s, the character regenerates 6~12 Energy for each seed consumed."
    },
    {
        "name": "Blackcliff Longsword",
        "rarity": 4,
        "attack": 565,
        "subStat": "CRIT DMG 36.8%",
        "effect": "Press the Advantage\nAfter defeating an opponent, ATK is increased by 12~24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
        "name": "Cinnabar Spindle",
        "rarity": 4,
        "attack": 454,
        "subStat": "DEF 69.0%",
        "effect": "Spotless Heart\nElemental Skill DMG is increased by 40~80% of DEF. The effect will be triggered no more than once every 1.5s and will be cleared 0.1s after the Elemental Skill deals DMG."
    },
    {
        "name": "Favonius Sword",
        "rarity": 4,
        "attack": 454,
        "subStat": "Energy Recharge 61.3%",
        "effect": "Windfall\nCRIT hits have a 60~100% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every 12~6s."
    },
    {
        "name": "Festering Desire",
        "rarity": 4,
        "attack": 510,
        "subStat": "Energy Recharge 45.9%",
        "effect": "Undying Admiration\nIncreases Elemental Skill DMG by 16~32% and Elemental Skill CRIT Rate by 6~12%."
    },
    {
        "name": "Finale of the Deep",
        "rarity": 4,
        "attack": 565,
        "subStat": "ATK 27.6%",
        "effect": "An End Sublime\nWhen using an Elemental Skill, ATK will be increased by 12~24% for 15s, and a Bond of Life worth 25% of Max HP will be granted. This effect can be triggered once every 10s. When the Bond of Life is cleared, a maximum of 150~300 ATK will be gained based on 2.4~4.8% of the total amount of the Life Bond cleared, lasting for 15s."
    },
    {
        "name": "Fleuve Cendre Ferryman",
        "rarity": 4,
        "attack": 510,
        "subStat": "Energy Recharge 45.9%",
        "effect": "Ironbone\nIncreases Elemental Skill CRIT Rate by 8~16%. Additionally, increases Energy Recharge by 16~32% for 5s after using an Elemental Skill."
    },
    {
        "name": "Flute of Ezpitzal",
        "rarity": 4,
        "attack": 454,
        "subStat": "DEF 69.0%",
        "effect": "Smoke-and-Mirror Mystery\nUsing an Elemental Skill increases DEF by 16~32% for 15s."
    },
    {
        "name": "Iron Sting",
        "rarity": 4,
        "attack": 510,
        "subStat": "Elemental Mastery 165",
        "effect": "Infusion Stinger\nDealing Elemental DMG increases all DMG by 6~12% for 6s. Max 2 stacks. Can only occur once every 1s."
    },
    {
        "name": "Kagotsurube Isshin",
        "rarity": 4,
        "attack": 510,
        "subStat": "ATK 41.3%",
        "effect": "Isshin Art Clarity\nWhen a Normal, Charged, or Plunging Attack hits an opponent, it will whip up a Hewing Gale, dealing AoE DMG equal to 180% of ATK and increasing ATK by 15% for 8s. This effect can be triggered once every 8s."
    },
    {
        "name": "Lion's Roar",
        "rarity": 4,
        "attack": 510,
        "subStat": "ATK 41.3%",
        "effect": "Bane of Fire and Thunder\nIncreases DMG against enemies affected by Pyro or Electro by 20~36%."
    },
    {
        "name": "Prototype Rancour",
        "rarity": 4,
        "attack": 565,
        "subStat": "Physical DMG Bonus 34.5%",
        "effect": "Smashed Stone\nOn hit, Normal or Charged Attacks increase ATK and DEF by 4~8% for 6s. Max 4 stacks. This effect can only occur once every 0.3s."
    },
    {
        "name": "Royal Longsword",
        "rarity": 4,
        "attack": 510,
        "subStat": "ATK 41.3%",
        "effect": "Focus\nUpon dealing damage to an opponent, increases CRIT Rate by 8~16%. Max 5 stacks. A CRIT hit removes all existing stacks."
    },
    {
        "name": "Sacrificial Sword",
        "rarity": 4,
        "attack": 454,
        "subStat": "Energy Recharge 61.3%",
        "effect": "Composed\nAfter dealing damage to an opponent with an Elemental Skill, the skill has a 40~80% chance to end its own CD. Can only occur once every 30~16s."
    },
    {
        "name": "Sapwood Blade",
        "rarity": 4,
        "attack": 565,
        "subStat": "Energy Recharge 30.6%",
        "effect": "Forest Sanctuary\nAfter triggering Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon, a Leaf of Consciousness will be created around the character for a maximum of 10s. When picked up, the Leaf will grant the character 60~120 Elemental Mastery for 12s. Only 1 Leaf can be generated this way every 20s. This effect can still be triggered if the character is not on the field. The Leaf of Consciousness' effect cannot stack."
    },
    {
        "name": "Sturdy Bone",
        "rarity": 4,
        "attack": 565,
        "subStat": "ATK 27.6%",
        "effect": "Trapper's Pride\nSprint or Alternate Sprint Stamina Consumption decreased by 15%. Additionally, after using Sprint or Alternate Sprint, Normal Attack DMG is increased by 16~32% of ATK. This effect expires after triggering 18 times or 7s."
    },
    {
        "name": "Sword of Descension",
        "rarity": 4,
        "attack": 440,
        "subStat": "ATK 35.2%",
        "effect": "Descension\nEffective only on the following platform:\n\"PlayStation Network\"\nHitting enemies with Normal or Charged Attacks grants a 50% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s.\nAdditionally, if the Traveler equips the Sword of Descension, their ATK is increased by 66."
    },
    {
        "name": "Sword of Narzissenkreuz",
        "rarity": 4,
        "attack": 510,
        "subStat": "ATK 41.3%",
        "effect": "Hero's Blade\nWhen the equipping character does not have an Arkhe: When Normal Attacks, Charged Attacks, or Plunging Attacks strike, a Pneuma or Ousia energy blast will be unleashed, dealing 160~320% of ATK as DMG. This effect can be triggered once every 12s. The energy blast type is determined by the current type of the Sword of Narzissenkreuz."
    },
    {
        "name": "The Alley Flash",
        "rarity": 4,
        "attack": 620,
        "subStat": "Elemental Mastery 55",
        "effect": "Itinerant Hero\nIncreases DMG dealt by the character equipping this weapon by 12~24%. Taking DMG disables this effect for 5s."
    },
    {
        "name": "The Black Sword",
        "rarity": 4,
        "attack": 510,
        "subStat": "CRIT Rate 27.6%",
        "effect": "Justice\nIncreases DMG dealt by Normal and Charged Attacks by 20~40%.\nAdditionally, regenerates 60~100% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s."
    },
    {
        "name": "The Dockhand's Assistant",
        "rarity": 4,
        "attack": 510,
        "subStat": "HP 41.3%",
        "effect": "Sea Shanty\nWhen the wielder is healed or heals others, they will gain a Stoic's Symbol that lasts 30s, up to a maximum of 3 Symbols. When using their Elemental Skill or Burst, all Symbols will be consumed and the Roused effect will be granted for 10s. For each Symbol consumed, gain 40~80 Elemental Mastery, and 2s after the effect occurs, 2~4 Energy per Symbol consumed will be restored for said character. The Roused effect can be triggered once every 15s, and Symbols can be gained even when the character is not on the field."
    },
    {
        "name": "The Flute",
        "rarity": 4,
        "attack": 510,
        "subStat": "ATK 41.3%",
        "effect": "Chord\nNormal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals 100~200% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s."
    },
    {
        "name": "Toukabou Shigure",
        "rarity": 4,
        "attack": 510,
        "subStat": "Elemental Mastery 165",
        "effect": "Kaidan: Rainfall Earthbinder\nAfter an attack hits opponents, it will inflict an instance of Cursed Parasol upon one of them for 10s. This effect can be triggered once every 15s. If this opponent is defeated during Cursed Parasol's duration, Cursed Parasol's CD will be refreshed immediately. The character wielding this weapon will deal 16~32% more DMG to the opponent affected by Cursed Parasol."
    },
    {
        "name": "Wolf-Fang",
        "rarity": 4,
        "attack": 510,
        "subStat": "CRIT Rate 27.6%",
        "effect": "Northwind Wolf\nDMG dealt by Elemental Skill and Elemental Burst is increased by 16~32%. When an Elemental Skill hits an opponent, its CRIT Rate will be increased by 2~4%. When an Elemental Burst hits an opponent, its CRIT Rate will be increased by 2~4%. Both of these effects last 10s separately, have 4 max stacks, and can be triggered once every 0.1s."
    },
    {
        "name": "Xiphos' Moonlight",
        "rarity": 4,
        "attack": 510,
        "subStat": "Elemental Mastery 165",
        "effect": "Jinni's Whisper\nThe following effect will trigger every 10s: The equipping character will gain 0.036~0.072% Energy Recharge for each point of Elemental Mastery they possess for 12s, with nearby party members gaining 30% of this buff for the same duration. Multiple instances of this weapon can allow this buff to stack. This effect will still trigger even if the character is not on the field."
    },
    {
        "name": "Cool Steel",
        "rarity": 3,
        "attack": 401,
        "subStat": "ATK 35.2%",
        "effect": "Bane of Water and Ice\nIncreases DMG against opponents affected by Hydro or Cryo by 12~24%."
    },
    {
        "name": "Dark Iron Sword",
        "rarity": 3,
        "attack": 401,
        "subStat": "Elemental Mastery 141",
        "effect": "Overloaded\nUpon causing an Overloaded, Superconduct, Electro-Charged, Quicken, Aggravate, Hyperbloom, or Electro-infused Swirl reaction, ATK is increased by 20~40% for 12s."
    },
    {
        "name": "Fillet Blade",
        "rarity": 3,
        "attack": 401,
        "subStat": "ATK 35.2%",
        "effect": "Gash\nOn hit, has 50% chance to deal 240~400% ATK DMG to a single enemy. Can only occur once every 15~11s."
    },
    {
        "name": "Harbinger of Dawn",
        "rarity": 3,
        "attack": 401,
        "subStat": "CRIT DMG 46.9%",
        "effect": "Vigorous\nWhen HP is above 90%, increases CRIT Rate by 14~28%."
    },
    {
        "name": "Skyrider Sword",
        "rarity": 3,
        "attack": 354,
        "subStat": "Energy Recharge 51.7%",
        "effect": "Determination\nUsing an Elemental Burst grants a 12~24% increase in ATK and Movement SPD for 15s."
    },
    {
        "name": "Traveler's Handy Sword",
        "rarity": 3,
        "attack": 448,
        "subStat": "DEF 29.3%",
        "effect": "Journey\nEach Elemental Orb or Particle collected restores 1~2% HP."
    },
    {
        "name": "Silver Sword",
        "rarity": 2,
        "attack": 243,
        "subStat": "None",
        "effect": "None"
    },
    {
        "name": "Dull Blade",
        "rarity": 1,
        "attack": 185,
        "subStat": "None",
        "effect": "None"
    }
]